In [3]:
import pandas as pd
import numpy as np

In [55]:
#merging and concatinating data
data = np.array(
    [[1,0,0,0],
    [0,1,0,0],
    [0,0,0,1],
    [0,0,1,0],
    [0,0,0,0]]
)
data

array([[1, 0, 0, 0],
       [0, 1, 0, 0],
       [0, 0, 0, 1],
       [0, 0, 1, 0],
       [0, 0, 0, 0]])

In [56]:
col_names= ["Red", "Blue", "Green", "is_NaN"]

In [57]:
df = pd.DataFrame(data, columns=col_names)

In [58]:
df

   Red  Blue  Green  is_NaN
0    1     0      0       0
1    0     1      0       0
2    0     0      0       1
3    0     0      1       0
4    0     0      0       0

In [59]:
df["missing"] = df.sum(axis=1) -1

In [60]:
df

   Red  Blue  Green  is_NaN  missing
0    1     0      0       0        0
1    0     1      0       0        0
2    0     0      0       1        0
3    0     0      1       0        0
4    0     0      0       0       -1

In [61]:
df["missing"].replace({-1:1}, inplace=True)

In [62]:
for i in df.columns:
    df[i].replace({1: i, 0:np.nan}, inplace=True)

In [63]:
df

   Red  Blue  Green  is_NaN  missing
0  Red   NaN    NaN     NaN      NaN
1  NaN  Blue    NaN     NaN      NaN
2  NaN   NaN    NaN  is_NaN      NaN
3  NaN   NaN  Green     NaN      NaN
4  NaN   NaN    NaN     NaN  missing

In [36]:
all_as_one = pd.DataFrame()
for i in df.columns:
    all_as_one = pd.concat([all_as_one, df[i]])

In [38]:
all_as_one.dropna()

        0
0     Red
1    Blue
3   Green
2  is_NaN